<?php
// +----------------------------------------------------------------------
// | 浩森PHP框架 [ IeasynetPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2018 北京浩森宇特互联科技有限公司 [ http://www.ieasynet.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://ieasynet.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | 作者: 拼搏 <378184@qq.com>
// +----------------------------------------------------------------------

return [
    // 产品信息
    'product_name'      => 'HuotunPHP',
    'product_version'   => '1.0.4',
    'build_version'     => '201706042207',
    'product_website'   => 'http://www.huotun.com',
    'product_update'    => 'http://www.huotun.com/checkUpdate',
    'develop_team'      => 'HuotunPHP',

    // 公司信息
    'company_name'    => '海南火豚娱乐有限公司',
    'company_website' => 'http://www.huotun.com',
];