<?php
// +----------------------------------------------------------------------
// | 浩森PHP框架 [ IeasynetPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2018 北京浩森宇特互联科技有限公司 [ http://www.ieasynet.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://ieasynet.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | 作者: 拼搏 <378184@qq.com>
// +----------------------------------------------------------------------

/**
 * 安装程序配置文件
 */
return array(
    //产品配置
    'install_product_name'   => 'HuotunPHP', //产品名称
    'install_website_domain' => 'http://www.HuotunPHP.com', //官方网址
    'install_company_name'   => '海南火豚娱乐有限公司', //公司名称
    'original_table_prefix'  => 'ien_', //默认表前缀

    // 安装配置
    'install_table_total' => 211, // 安装时，需执行的sql语句数量
);
